//5. Написать программу вычисления значения функции y=f(a)/  sin

double FindSin (double leg, double hypo)
{
    double sin = leg / hypo;
    return sin;
}

 Console.WriteLine(FindSin(51, 100));
